#დავალება 1:
#შეიყვანე სიტყვა, სანამ მისი პირველი და ბოლო ასოები არ იქნებიან თანხმოვნები.
 #რას ნიშნავს?
#შენ უნდა უთხრა რობოტს სიტყვები.
#მაგრამ რობოტი შეგეკითხება ბევრჯერ, სანამ არ ეტყვი ისეთ სიტყვას, რომლის პირველი ასოც და ბოლო ასოც არცერთი არ არის ხმოვანი (ანუ არ არის ა, ე, ი, ო, უ).

 #მაგალითი:

#სიტყვა: მარიამი → პირველი: მ (კარგია), ბოლო: ი (ხმოვანი ❌) → რობოტი არ მიიღებს

#სიტყვა: ბაღი → ბ (კარგია), ი (ხმოვანი ❌) → არ მიიღებს

#სიტყვა: ბაბუა → ბ (კარგია), ა (ხმოვანი ❌) → არ მიიღებს

#სიტყვა: ბამბა → ბ (კარგია), ა (ხმოვანი ❌) → არ მიიღებს

#სიტყვა: კურდღელთ → კ (კარგია), თ (კარგია ✅✅) → აი ეს უკვე სწორი სიტყვაა!

vowels = ['ა', 'ე', 'ი', 'ო', 'უ']

while True:
    word = input("შეიყვანე სიტყვა: ")
    if word[0] not in vowels and word[-1] not in vowels:
        print("სწორი სიტყვაა")
        break
    else:
        print("არასწორია, სცადე სხვა სიტყვა")


#დავალება 2:
#შეიყვანე 5 სიტყვა, მაგრამ შეინახე (დაახსოვრე) მხოლოდ ისინი, რომლებიც სწორია.
 #რა არის „სწორი“ სიტყვა?
#ამაში უნდა გითხრან წინასწარ რა კრიტერიუმით აირჩიე სწორი, მაგრამ დავუშვათ, სიტყვა სწორია მაშინ, როცა მასში ორივე — პირველი და ბოლო ასოები — თანხმოვნებია.

#შენ უნდა უთხრა 5 სიტყვა. რობოტი კი შეინახავს მხოლოდ იმ სიტყვებს, რომლებიც სწორია.

vowels = ['ა', 'ე', 'ი', 'ო', 'უ']
valid_words = []

for i in range(5):
    word = input(f"{i+1}) შეიყვანე სიტყვა: ")
    if word[0] not in vowels and word[-1] not in vowels:
        valid_words.append(word)

print("შენახული სწორი სიტყვები:")



#დავალება 3:
#რობოტმა უნდა დაითვალოს, რამდენჯერ სცადე სწორი სიტყვის შეყვანა.
#ანუ ყოველ ჯერზე, როცა სწორი სიტყვა უთხარი, უნდა დაიმახსოვროს და უთხრას ბოლოს რიცხვი.

vowels = ['ა', 'ე', 'ი', 'ო', 'უ']
count = 0

for i in range(5):
    word = input("შეიყვანე სიტყვა: ")
    if word[0] not in vowels and word[-1] not in vowels:
        count += 1

print("სწორი სიტყვების რაოდენობა:")


#დავალება 4:
#შეიყვანე 10 სიტყვა, მაგრამ დაბეჭდოს (გამოაჩინოს) მხოლოდ სწორი სიტყვები.
# ანუ ისევ იგივე ლოგიკა – 10 სიტყვა უთხარი, მაგრამ ეკრანზე უნდა გამოჩნდეს მხოლოდ სწორი სიტყვები (ისინი, რომელთაც პირველი და ბოლო ასო თანხმოვანია, ან რაც წესია მოცემულ ამოცანაში 
# ). 

vowels = ['ა', 'ე', 'ი', 'ო', 'უ']
correct = []

for i in range(10):
    word = input(f"{i+1}) შეიყვანე სიტყვა: ")
    if word[0] not in vowels and word[-1] not in vowels:
        correct.append(word)

print("სწორი სიტყვები:")


#დავალება 5:
#შეიყვანე სიტყვა და რობოტმა უნდა დათვალოს რამდენი ხმოვანია და რამდენი თანხმოვანი აქვს მას.
#გაიმეორებს ამას მანამ, სანამ არ შეიყვან სწორ სიტყვას.

 #ანუ რობოტს ეუბნები სიტყვას → ის გეუბნება:

#"ამ სიტყვაში არის 3 ხმოვანი და 4 თანხმოვანი"

#და გთხოვს ახალს, სანამ სწორ სიტყვას არ ეტყვი.


vowels = ['ა', 'ე', 'ი', 'ო', 'უ']

while True:
    word = input("შეიყვანე სიტყვა: ")
    v_count = 0
    c_count = 0
    for letter in word:
        if letter in vowels:
            v_count += 1
        else:
            c_count += 1
    print(f"ამ სიტყვაში არის {v_count} ხმოვანი და {c_count} თანხმოვანი.")
    
    if word[0] not in vowels and word[-1] not in vowels:
        print("ეს სიტყვა სწორია ")
        break
    else:
        print("სცადე თავიდან ")